In [2]:
import numpy as np
import pandas as pd

In [3]:
f=open('birthdates.txt','r')

In [4]:
file=f.read()

In [5]:
file

'day, month, year, name\n10, 12, 1997, Sarah\n4, 11, 1999, Katherine\n28, 4, 1964, Rich\n24, 11, 1963, Martha\n22, 7, 1998, Scott'

In [6]:
header,_,rows=file.partition('\n')

In [7]:
header

'day, month, year, name'

In [8]:
rows

'10, 12, 1997, Sarah\n4, 11, 1999, Katherine\n28, 4, 1964, Rich\n24, 11, 1963, Martha\n22, 7, 1998, Scott'

In [9]:
numcolumns=header.count(',')+1

In [10]:
columnnames=np.empty(numcolumns,dtype=np.dtypes.StrDType)
remainingheader=header
for i in range(numcolumns):
    current,_,remainingheader=remainingheader.partition(', ')
    columnnames[i]=current

In [11]:
columnnames

array(['day', 'month', 'year', 'name'], dtype=object)

In [12]:
numrows=rows.count('\n')+1

In [13]:
data=np.empty((numrows,numcolumns),dtype=np.dtypes.StrDType)

In [14]:
table=pd.DataFrame(data,columns=columnnames)

In [15]:
table

    day month  year  name
0  None  None  None  None
1  None  None  None  None
2  None  None  None  None
3  None  None  None  None
4  None  None  None  None

In [16]:
remainingrows=rows
for i in range(numrows):
    currentrow,_,remainingrows=remainingrows.partition('\n')
    for j in range(numcolumns):
        currentelement,_,currentrow=currentrow.partition(', ')
        table.iloc[i, j]=currentelement

In [17]:
table

  day month  year       name
0  10    12  1997      Sarah
1   4    11  1999  Katherine
2  28     4  1964       Rich
3  24    11  1963     Martha
4  22     7  1998      Scott